use TourAgencyAndroid

insert into Country
values ('Турция', 'http://icons.iconarchive.com/icons/hopstarter/square-flags/32/Turkey-Flag-icon.png'),
       ('Египет', 'http://icons.iconarchive.com/icons/hopstarter/square-flags/32/Egypt-Flag-icon.png'),
       ('Грузия', 'http://icons.iconarchive.com/icons/hopstarter/square-flags/32/Georgia-Flag-icon.png'),
       ('Греция', 'http://icons.iconarchive.com/icons/hopstarter/square-flags/32/Greece-Flag-icon.png'),
       ('Таиланд', 'http://icons.iconarchive.com/icons/hopstarter/square-flags/32/Thailand-Flag-icon.png')

insert into City
values ('Анталия', 1),
       ('Кемер', 1),
       ('Алания', 1),
       ('Хургада', 2),
       ('Шарм-эль-Шейх', 2),
       ('‎Батуми', 3),
       ('Сарпи', 3),
       ('Закинф', 4),
       ('Крит', 4),
       ('Бангкок', 5),
       ('Пхукет', 5)

insert into Accommodation
values ('Все включено'),
       ('Завтрак'),
       ('Полупансион')


insert into Hotel(name, nStar, idCity, photoLinks, [description])
values ('The Grand Hotel Sharm El Sheikh', 5, 5,
        'https://img.silpovoyage.ua/5/954x510/00/10/40/14/10401433.jpg https://img.silpovoyage.ua/5/954x510/00/10/40/14/10401446.jpg https://img.silpovoyage.ua/5/954x510/00/10/40/14/10401439.jpg https://img.silpovoyage.ua/5/954x510/00/10/40/14/10401462.jpg',
        'В готелі 627 номерів. У 30 км до аеропорту, до центру міста - 15 км Готель побудований в 2008 році в традиційному арабському стилі. Готель підійде для любителів снорклінга і цінителів міської інфраструктури і різноманітного харчування. Не рекомендується людям похилого віку з-за наявних сходів і спусків, а також для пересування з колясками. Готель для спокійного відпочинку. Входить в одну з найбільших ланцюжків готелів Red Sea Hotels, що включає готелі в Хургаді, Макаді та Шарм Ель Шейху, відмінною рисою яких є великі по протяжності пляжі і ідеально доглянута зелена територія з садами і фігурними басейнами. Готель надає гостям безкоштовну щоденну розвозку до Наама Бей.'),
       ('Luna Sharm Hotel', 3, 5,
        'https://img.silpovoyage.ua/5/954x510/00/01/86/88/1868846.jpg https://img.silpovoyage.ua/5/954x510/00/01/86/88/1868854.jpg https://img.silpovoyage.ua/5/954x510/00/01/86/88/1868865.jpg https://img.silpovoyage.ua/5/954x510/00/01/86/88/1868852.jpg',
        'В готелі 124 номери. Готель розташований в 27 км від аеропорту. Готель розташований в декількох кілометрах від центру Шарм-Ель-Шейха, в 3 км від Старого міста, в районі Hadaba. Відкритий в 2004 році, остання проводилась реновація в 2009 році. Підійде для сімейного, романтичного або молодіжного відпочинку.'),
       ('Roma Hotel', 4, 4,
        'https://img.silpovoyage.ua/5/954x510/00/10/37/82/10378210.jpg https://img.silpovoyage.ua/5/954x510/00/00/07/94/79480.jpg https://img.silpovoyage.ua/5/954x510/00/02/93/11/2931106.jpg https://img.silpovoyage.ua/5/954x510/00/02/93/11/2931112.jpg',
        'В готелі 147 номерів. В 5 км від аеропорту р. Хургада, в р. Хургада. Готель був відкритий в 1999 році, остання проводилась реновація в 2015 році. Готель складається з головного 4-поверхової будівлі. Один з кращих центральних готелів у Хургаді (туристичний центр). Поруч знаходяться найвідоміші дискотеки, ресторани, де ввечері збираються відпочиваючі з усього курорту.'),
       ('Golden 5 The Club Hotel', 4, 4,
        'https://img.silpovoyage.ua/5/954x510/00/01/79/31/1793188.jpg https://img.silpovoyage.ua/5/954x510/00/01/79/31/1793160.jpg https://img.silpovoyage.ua/5/954x510/00/01/79/31/1793162.jpg https://img.silpovoyage.ua/5/954x510/00/01/79/31/1793168.jpg',
        'В готелі 400 номерів. В 11 км від аеропорту Хургади, в 14 км від центру міста. Готель входить в величезний готельний комплекс Golden 5 City на узбережжі. В готелі є паравозик Taff-Taff, який ходить за розкладом, і возить людей по всьому комплексу і до моря. Гості готелю користуються всією інфраструктурою комплексу Golden 5, можуть безкоштовно відвідувати аквапарк комплексу, шоу співаючих фонтанів, та інших ресторани готелів комплексу.'),
       ('Sand Beach Hotel', 3, 4,
        'https://img.silpovoyage.ua/5/954x510/00/02/93/12/2931267.jpg https://img.silpovoyage.ua/5/954x510/00/00/05/94/59462.jpg https://img.silpovoyage.ua/5/954x510/00/00/05/94/59458.jpg https://img.silpovoyage.ua/5/954x510/00/00/05/94/59461.jpg',
        'В готелі 140 номерів. В 13 км від аеропорту Хургади, в 1 км від Старого міста. Знаходиться в 15 хвилинах ходьби від центру міста, на узбережжі. Хороший готель середньої категорії з щоденної розважальною програмою та дискотекою. Відкритий у 1990 році, остання часткова реновація пройшла в 2008 році. Готель складається з основного 3-поверхового будинку, двох 2-поверхових корпусів і двох 2-поверхових бунгало.'),
       ('Assos Hotel Istanbul', 3, 2,
        'https://img.silpovoyage.ua/5/954x510/00/01/72/96/1729639.jpg https://img.silpovoyage.ua/5/954x510/00/01/72/96/1729636.jpg https://img.silpovoyage.ua/5/954x510/00/01/72/96/1729634.jpg https://img.silpovoyage.ua/5/954x510/00/01/72/96/1729632.jpg',
        'Всего в отеле 50 номеров. 17 км от международного аэропорта имени Ататюрка. 200 м от трамвайной остановки. Отель расположен в исторической части Стамбула, в районе Беязыт, рядом с Гранд базаром. В нескольких минутах ходьбы находятся Голубая мечеть, собор Святой Софии и дворец Топкапы. Отель прекрасно подойдёт для комфортного отдыха и осмотра достопримечательностей.'),
       ('All Seasons Hotel', 4, 2,
        'https://img.silpovoyage.ua/5/954x510/00/11/23/00/11230015.jpg https://img.silpovoyage.ua/5/954x510/00/11/23/00/11230021.jpg https://img.silpovoyage.ua/5/954x510/00/11/23/00/11230017.jpg https://img.silpovoyage.ua/5/954x510/00/11/23/00/11230018.jpg',
        'Всего в отеле 70 номеров. 1,3 км от вокзала Йеникапы. Отель расположен в историческом центре Стамбула, в 15 минутах езды от площади Султанахмет, Гранд Базара, собора Святой Софии. Отель открыт в 2001 году. Трамвайная остановка находится в 10 метрах от отеля. Отличный выбор для комфортного отдыха и изучения достопримечательностей Стамбула.'),
       ('Raymond Hotel', 4, 1,
        'https://img.silpovoyage.ua/5/954x510/00/00/09/86/98641.jpg https://img.silpovoyage.ua/5/954x510/00/00/09/86/98637.jpg https://img.silpovoyage.ua/5/954x510/00/00/09/86/98640.jpg https://img.silpovoyage.ua/5/954x510/00/10/37/82/10378228.jpg',
        'В готелі 36 номерів. Цей готель розташований менш ніж за 200 метрів від трамвайної зупинки Gülhane. Менш ніж у 5 хвилинах ходьби собор Святої Софії і археологічний музей Стамбулу. Залізничний вокзал Сиркечи розташований менш ніж за 600 метрів від готелю. Готель розташований недалеко від трамвайної зупинки і пропонує своїм гостям комфортабельні просторі номери, безкоштовний Wi-Fi і ресторані, де сервіруються вегетаріанські та м''ясні страви.'),
       ('Laleli Gonen Hotel', 3, 1,
        'https://img.silpovoyage.ua/5/954x510/00/00/23/12/231290.jpg https://img.silpovoyage.ua/5/954x510/00/02/99/54/2995456.jpg https://img.silpovoyage.ua/5/954x510/00/00/23/12/231298.jpg https://img.silpovoyage.ua/5/954x510/00/02/99/54/2995460.jpg',
        'В готелі 419 номерів. В 9 км від аеропорту . Готель ідеально розташований поряд з власним пляжем і не далеко від торгового центру міста - це дасть Вам можливість насолоджуватися всім, що є на побережжі Червоного моря: рухом міського життя або спокійним чарівністю природних чудесх такого близького моря. Побудований у 1996 році, остання реновація – в 2009 році.'),
       ('Santa Sophia Hotel', 3, 3,
        'https://img.silpovoyage.ua/5/954x510/00/00/00/18/1884.jpg https://img.silpovoyage.ua/5/954x510/00/00/22/93/229308.jpg https://img.silpovoyage.ua/5/954x510/00/00/22/93/229305.jpg https://img.silpovoyage.ua/5/954x510/00/00/22/92/229299.jpg',
        'В готелі 207 номерів. В 5 км від аеропорту, в 15 км від Naama Bay і в 20 км від Старого міста. Готель розташований в кінці бухти Шаркс Бей. У безпосередній близькості від готелю знаходиться готель Sharm, разом вони утворюють один комплекс з загальною територією і пляжем, всі інші послуги, такі як бари, ресторани тощо, в кожному готелі. Відкритий в березні 2007 року. Підходить для спокійного сімейного відпочинку. Готель складається з основного 3-поверхова будівля комплексу і 3-поверхових корпусів.'),
       ('Malkoc Hotel', 4, 3,
        'https://img.silpovoyage.ua/5/954x510/00/01/79/37/1793740.jpg https://img.silpovoyage.ua/5/954x510/00/01/79/37/1793734.jpg https://img.silpovoyage.ua/5/954x510/00/01/79/37/1793732.jpg https://img.silpovoyage.ua/5/954x510/00/01/79/37/1793730.jpg',
        'В готелі 284 номери. В 9 км до аеропорту. Готель розташований на Синайському півострові, на узбережжі Червоного моря, має панорамний вид на бухту Паша Бей. Готель побудований на горі, до пляжу можна спуститися по сходах. Загальна територія з готелем Sharm Plaza. Гості готелю Sharm Resort можуть користуватися всіма послугами готелю Sharm Plaza. Готелі входять в одну з найбільших ланцюжків готелів Red Sea Hotels , що включає готелі в Хургаді, Макаді та Шарм Ель Шейху, відмінною рисою яких є великі по протяжності пляжі і ідеально доглянута зелена територія з садами і фігурними басейнами.'),
       ('New Nordic Holiday', 3, 10,
        'https://img.silpovoyage.ua/5/954x510/00/02/24/39/2243958.jpg https://img.silpovoyage.ua/5/954x510/00/02/24/39/2243989.jpg https://img.silpovoyage.ua/5/954x510/00/02/24/39/2243961.jpg https://img.silpovoyage.ua/5/954x510/00/02/24/39/2243957.jpg',
        'В готелі 147 номерів. В 5 км від аеропорту . Готель був відкритий в 1999 році, остання проводилась реновація в 2015 році. Готель складається з головного 4-поверхової будівлі. Один з кращих центральних готелів у Хургаді (туристичний центр). Поруч знаходяться найвідоміші дискотеки, ресторани, де ввечері збираються відпочиваючі з усього курорту.'),
       ('Dragon Beach Resort Jomtien Pattaya', 4, 10,
        'https://img.silpovoyage.ua/5/954x510/00/10/05/52/10055248.jpg https://img.silpovoyage.ua/5/954x510/00/10/05/52/10055247.jpg https://img.silpovoyage.ua/5/954x510/00/10/05/52/10055263.jpg https://img.silpovoyage.ua/5/954x510/00/10/05/52/10055279.jpg',
        '138 номерів. 160 км від аеропорту Бангкока. 10 км від центру р. Паттайя. Готель розташований в центральній частині району Джомтьен. Він складається з двох корпусів: Main Wing і New Wing. Останній ремонт був проведений в 2011 році.'),
       ('The Romeo Palace Hotel', 4, 10,
        'https://img.silpovoyage.ua/5/954x510/00/10/45/04/10450414.jpg https://img.silpovoyage.ua/5/954x510/00/10/45/04/10450418.jpg https://img.silpovoyage.ua/5/954x510/00/10/45/04/10450415.jpg https://img.silpovoyage.ua/5/954x510/00/10/45/04/10450452.jpg',
        'В 5-ти поверховому корпусі розташований 101 номер. Розташований в 90 хвилинах від аеропорту Suvarnabhumi. Готель Romeo Palace розмістився у районі Північна Паттайя, в 5-ти хвилинах ходьби від пляжу Вонг Амат. Готель Romeo знаходиться в 2 км від Храму істини. Пляж Паттайї і пірс Балі Хай розташовані на відстані 2,5 км.'),
       ('APK Resort & Spa', 3, 11,
        'https://img.silpovoyage.ua/5/954x510/00/10/59/61/10596100.jpg https://img.silpovoyage.ua/5/954x510/00/10/59/61/10596103.jpg https://img.silpovoyage.ua/5/954x510/00/10/59/61/10596134.jpg https://img.silpovoyage.ua/5/954x510/00/10/59/60/10596098.jpg',
        'В готелі 103 номери. Готель розташований в центрі Patong. Apk Resort – відмінний готель, що розташувався в самому серці міста і оточений чудовими краєвидами гір і моря. Готель пропонує своїм гостям просторі номери, професійне обслуговування, теплу доброзичливу атмосферу.'),
       ('Sharaya Boutique Hotel', 4, 11,
        'https://img.silpovoyage.ua/5/954x510/00/01/74/22/1742253.jpg https://img.silpovoyage.ua/5/954x510/00/01/74/22/1742252.jpg https://img.silpovoyage.ua/5/954x510/00/01/74/22/1742250.jpg https://img.silpovoyage.ua/5/954x510/00/01/74/22/1742265.jpg',
        '60 номерів. 40 хвилин їзди від міжнародного аеропорту Пхукета. Готель розташований в 700 м від пляжу Патонг. Останній ремонт проводився в 2012 році'),
       ('PJ Patong Resortel', 5, 11,
        'https://img.silpovoyage.ua/5/954x510/00/00/18/74/187478.jpg https://img.silpovoyage.ua/5/954x510/00/00/18/74/187481.jpg https://img.silpovoyage.ua/5/954x510/00/00/18/74/187482.jpg https://img.silpovoyage.ua/5/954x510/00/00/18/74/187484.jpg',
        'В готелі 40 номерів. Розташування: в 25 км від аеропорту, в 15 хвилинах ходьби від пляжу Патонг. PJ Patong Resortel розташований на красивому пляжі Патонг, всього в 5 хвилинах ходьби від кращих торгових центрів (Jungceylon) і в 10 хвилинах ходьби від Бангла-роуд. Красиві білі піски, кришталева вода, торгові ряди, оточений нічним життям готель порадує Вас своєю гостинністю.')


insert into Tour(idHotel, idAccommodation, quantity, checkIn, checkOut, price)
values (1, 1, 30, '2020-02-25', '2020-03-03', 7053),
       (2, 2, 50, '2020-03-15', '2020-03-22', 7139),
       (3, 1, 25, '2020-02-21', '2020-03-01', 8297),
       (4, 2, 43, '2020-03-02', '2020-03-10', 8532),
       (5, 3, 35, '2020-02-02', '2020-02-11', 8133),
       (6, 3, 21, '2020-02-05', '2020-02-12', 22464),
       (7, 1, 25, '2020-02-17', '2020-02-24', 22720),
       (8, 2, 15, '2020-03-03', '2020-03-13', 22720),
       (9, 3, 15, '2020-02-14', '2020-02-21', 22947),
       (10, 1, 13, '2020-03-08', '2020-03-15', 21527),
       (11, 2, 15, '2020-02-07', '2020-02-15', 22038),
       (12, 1, 20, '2020-02-16', '2020-02-23', 47944),
       (13, 2, 23, '2020-03-02', '2020-03-12', 48691),
       (14, 1, 25, '2020-02-19', '2020-02-27', 50436),
       (15, 3, 14, '2020-02-16', '2020-02-25', 60159),
       (16, 2, 16, '2020-03-20', '2020-03-28', 59728),
       (17, 1, 10, '2020-02-14', '2020-02-25', 75116)


